Revit 2027 API
BuiltInFailures.StairRampFailures.CannotProcessInStairsSketchEditMode Property
 Cannot process when stair(s) in sketch edit mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotProcessInStairsSketchEditMode { get; }
Public Shared ReadOnly Property CannotProcessInStairsSketchEditMode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotProcessInStairsSketchEditMode {
	FailureDefinitionId^ get ();
}
static member CannotProcessInStairsSketchEditMode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace